In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'From_to':['LonDon_paris','MAdrid_miLAN','lonDOn_stoCKhOlm','Budapest_Paris','Brussels_LonDON'],'FlightNumber':
                [10045,np.nan,10065,np.nan,10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],'Airline':
                ['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France','''Swiss Air''']})
df

            From_to  FlightNumber  RecentDelays             Airline
0      LonDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  lonDOn_stoCKhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_Paris           NaN          [13]       12.Air France
4   Brussels_LonDON       10085.0      [67, 32]           Swiss Air

In [3]:
df.dtypes

From_to          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

__Q1:__

In [4]:
for i in range(0,5):
    if pd.isnull(df['FlightNumber'].loc[i,]):
        df.loc[i,'FlightNumber']=df['FlightNumber'].loc[i-1,]+10

In [5]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [6]:
df['FlightNumber']=df['FlightNumber'].astype(int)

__Q2:__

In [7]:
list2=[]
for i in df['From_to']:
    list1=i.split('_')
    list2.append(list1)
print(list2)

[['LonDon', 'paris'], ['MAdrid', 'miLAN'], ['lonDOn', 'stoCKhOlm'], ['Budapest', 'Paris'], ['Brussels', 'LonDON']]

In [8]:
list3=[]
list4=[]
for i in range(len(list2)):
    list3.append(list2[i][0])
    list4.append(list2[i][1])
    temp=pd.DataFrame({'From':list3,'To':list4})

In [9]:
temp

       From         To
0    LonDon      paris
1    MAdrid      miLAN
2    lonDOn  stoCKhOlm
3  Budapest      Paris
4  Brussels     LonDON

__Q3:__

In [10]:
list5=[]
list6=[]
for i in temp['From']:
    list5.append(i.lower().capitalize())
for i in temp['To']:
    list6.append(i.lower().capitalize())

In [11]:
list6

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [12]:
temp=pd.DataFrame({'From':list5,'To':list6}) 
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

__Q4:__

In [13]:
new_df=df.iloc[:,1:]
df1=pd.concat([new_df,temp],axis=1)

In [14]:
df1

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]           Swiss Air  Brussels     London

__Q5:__

In [15]:
df2=pd.DataFrame(df1['RecentDelays'].values.tolist(),columns=['Delay_1','Delay_2','Delay_3'])
df2

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [16]:
df1.drop(['RecentDelays'],axis=1)

   FlightNumber             Airline      From         To
0         10045              KLM(!)    London      Paris
1         10055    <Air France>(12)    Madrid      Milan
2         10065  (British Airways.)    London  Stockholm
3         10075       12.Air France  Budapest      Paris
4         10085           Swiss Air  Brussels     London

In [17]:
final_df=pd.concat([df1,df2],axis=1)

In [18]:
final_df

,FlightNumber,RecentDelays,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France>(12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways.),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12.Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]",Swiss Air,Brussels,London,67.0,32.0,NaN